remotemcu/remcu-chip-sdks/freescale/KSDK_1.3/platform/hal/src/sim/MK66F18/fsl_sim_hal_MK66F18.c
/*
 * Copyright (c) 2013 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>
#include "fsl_device_registers.h"
#include "fsl_sim_hal.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * APIs
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_SetUsbfsDiv
 * Description   : Sets USB divider setting.
 * Divider output clock = Divider input clock * [ (USBFRAC+1) / (USBDIV+1) ]
 *
 *END**************************************************************************/
void CLOCK_HAL_SetUsbfsDiv(SIM_Type * base,
                           uint8_t usbdiv,
                           uint8_t usbfrac)
{
    SIM_BWR_CLKDIV2_USBDIV(base, usbdiv);
    SIM_BWR_CLKDIV2_USBFRAC(base, usbfrac);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_GetUsbfsDiv
 * Description   : Gets USB divider setting.
 * Divider output clock = Divider input clock * [ (USBFRAC+1) / (USBDIV+1) ]
 *
 *END**************************************************************************/
void CLOCK_HAL_GetUsbfsDiv(SIM_Type * base,
                           uint8_t *usbdiv,
                           uint8_t *usbfrac)
{
    *usbdiv  = SIM_BRD_CLKDIV2_USBDIV(base);
    *usbfrac = SIM_BRD_CLKDIV2_USBFRAC(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_SetPllFllDiv
 * Description   : Sets PLL/FLL divider setting.
 * Divider output clock = Divider input clock * [ (PLLFLLFRAC+1) / (PLLFLLDIV+1) ]
 *
 *END**************************************************************************/
void CLOCK_HAL_SetPllFllDiv(SIM_Type * base,
                           uint8_t pllflldiv,
                           uint8_t pllfllfrac)
{
    SIM_BWR_CLKDIV3_PLLFLLDIV(base, pllflldiv);
    SIM_BWR_CLKDIV3_PLLFLLFRAC(base, pllfllfrac);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_GetPllFllDiv
 * Description   : Get PLL/FLL divider setting.
 * Divider output clock = Divider input clock * [ (PLLFLLFRAC+1) / (PLLFLLDIV+1) ]
 *
 *END**************************************************************************/
void CLOCK_HAL_GetPllFllDiv(SIM_Type * base,
                           uint8_t *pllflldiv,
                           uint8_t *pllfllfrac)
{
    *pllflldiv  = SIM_BRD_CLKDIV3_PLLFLLDIV(base);
    *pllfllfrac = SIM_BRD_CLKDIV3_PLLFLLFRAC(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_SetTraceDiv
 * Description   : Sets TRACECLK divider setting.
 * Divider output clock = Divider input clock * [ (TRACEFRAC+1) / (TRACEDIV+1) ]
 *
 *END**************************************************************************/
void CLOCK_HAL_SetTraceDiv(SIM_Type * base,
                           uint8_t tracediv,
                           uint8_t tracefrac)
{
    SIM_BWR_CLKDIV4_TRACEDIV(base, tracediv);
    SIM_BWR_CLKDIV4_TRACEFRAC(base, tracefrac);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_GetTraceDiv
 * Description   : Get TRACECLK divider setting.
 * Divider output clock = Divider input clock * [ (TRACEFRAC+1) / (TRACEDIV+1) ]
 *
 *END**************************************************************************/
void CLOCK_HAL_GetTraceDiv(SIM_Type * base,
                           uint8_t *tracediv,
                           uint8_t *tracefrac)
{
    *tracediv  = SIM_BRD_CLKDIV4_TRACEDIV(base);
    *tracefrac = SIM_BRD_CLKDIV4_TRACEFRAC(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_SetOutDiv
 * Description   : Set all clock out dividers setting at the same time
 * This function will set the setting for all clock out dividers.
 *
 *END**************************************************************************/
void CLOCK_HAL_SetOutDiv(SIM_Type * base,
                         uint8_t outdiv1,
                         uint8_t outdiv2,
                         uint8_t outdiv3,
                         uint8_t outdiv4)
{
    uint32_t clkdiv1 = 0;

    clkdiv1 |= SIM_CLKDIV1_OUTDIV1(outdiv1);
    clkdiv1 |= SIM_CLKDIV1_OUTDIV2(outdiv2);
    clkdiv1 |= SIM_CLKDIV1_OUTDIV3(outdiv3);
    clkdiv1 |= SIM_CLKDIV1_OUTDIV4(outdiv4);

    SIM_WR_CLKDIV1(base, clkdiv1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_GetOutDiv
 * Description   : Get all clock out dividers setting at the same time
 * This function will get the setting for all clock out dividers.
 *
 *END**************************************************************************/
void CLOCK_HAL_GetOutDiv(SIM_Type * base,
                         uint8_t *outdiv1,
                         uint8_t *outdiv2,
                         uint8_t *outdiv3,
                         uint8_t *outdiv4)
{
    *outdiv1 = SIM_BRD_CLKDIV1_OUTDIV1(base);
    *outdiv2 = SIM_BRD_CLKDIV1_OUTDIV2(base);
    *outdiv3 = SIM_BRD_CLKDIV1_OUTDIV3(base);
    *outdiv4 = SIM_BRD_CLKDIV1_OUTDIV4(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_SetAdcAlternativeTriggerCmd
 * Description   : Set ADCx alternate trigger enable setting
 * This function will enable/disable alternative conversion triggers for ADCx.
 *
 *END**************************************************************************/
void SIM_HAL_SetAdcAlternativeTriggerCmd(SIM_Type * base,
                                         uint32_t instance,
                                         bool enable)
{
    assert(instance < ADC_INSTANCE_COUNT);

